In [1]:
import numpy as np
import pandas as pd

## 시리즈

In [2]:
# Series 만들기
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
# 날짜 만들기
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

## 데이터프레임

In [4]:
# DataFrame 만들기
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])
df

                   A         B         C         D
2013-01-01 -0.110676  0.033004  1.018412  0.890824
2013-01-02 -0.280963  0.651658 -0.248009 -0.040365
2013-01-03 -1.950478  1.406947 -0.797436 -0.187886
2013-01-04 -1.165961 -1.188962  0.537421 -1.735304
2013-01-05 -0.786793 -0.260679 -0.578919  0.808183
2013-01-06 -0.529223 -1.382335  0.641045  1.194339

In [5]:
df.head()

                   A         B         C         D
2013-01-01 -0.110676  0.033004  1.018412  0.890824
2013-01-02 -0.280963  0.651658 -0.248009 -0.040365
2013-01-03 -1.950478  1.406947 -0.797436 -0.187886
2013-01-04 -1.165961 -1.188962  0.537421 -1.735304
2013-01-05 -0.786793 -0.260679 -0.578919  0.808183

In [6]:
# 인덱스 확인하기
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
# 컬럼 확인하기
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [8]:
# 내용 확인하기
df.values

array([[-0.11067637,  0.03300432,  1.01841167,  0.89082448],
       [-0.28096327,  0.65165848, -0.24800939, -0.04036499],
       [-1.95047834,  1.40694724, -0.79743577, -0.18788643],
       [-1.16596095, -1.18896248,  0.53742103, -1.73530354],
       [-0.78679263, -0.26067906, -0.57891915,  0.80818309],
       [-0.52922338, -1.38233546,  0.64104463,  1.19433875]])

In [9]:
# 데이터프레임 정보 확인하기
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [10]:
# 데이터프레임의 통계적 개요 확인하기
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.804016 -0.123394  0.095419  0.154965
std    0.674610  1.068300  0.736865  1.074923
min   -1.950478 -1.382335 -0.797436 -1.735304
25%   -1.071169 -0.956892 -0.496192 -0.151006
50%   -0.658008 -0.113837  0.144706  0.383909
75%   -0.343028  0.496995  0.615139  0.870164
max   -0.110676  1.406947  1.018412  1.194339

In [11]:
# 정렬하기
df.sort_values(by='B', ascending=False)
# ascending 옵션으로 내림차순 오름차순 선택 가능

                   A         B         C         D
2013-01-03 -1.950478  1.406947 -0.797436 -0.187886
2013-01-02 -0.280963  0.651658 -0.248009 -0.040365
2013-01-01 -0.110676  0.033004  1.018412  0.890824
2013-01-05 -0.786793 -0.260679 -0.578919  0.808183
2013-01-04 -1.165961 -1.188962  0.537421 -1.735304
2013-01-06 -0.529223 -1.382335  0.641045  1.194339

In [12]:
# 해당 컬럼만 보기
df['A']
# 해당 컬럼만 Series로 보여준다.

2013-01-01   -0.110676
2013-01-02   -0.280963
2013-01-03   -1.950478
2013-01-04   -1.165961
2013-01-05   -0.786793
2013-01-06   -0.529223
Freq: D, Name: A, dtype: float64

In [13]:
# 3행까지 보기
# df.head(3)
df[:3]
# 둘 다 가능하다.

                   A         B         C         D
2013-01-01 -0.110676  0.033004  1.018412  0.890824
2013-01-02 -0.280963  0.651658 -0.248009 -0.040365
2013-01-03 -1.950478  1.406947 -0.797436 -0.187886

In [14]:
# 인덱스를 직접 지정해서 보고싶다면?
df['20130101':'20130104']

                   A         B         C         D
2013-01-01 -0.110676  0.033004  1.018412  0.890824
2013-01-02 -0.280963  0.651658 -0.248009 -0.040365
2013-01-03 -1.950478  1.406947 -0.797436 -0.187886
2013-01-04 -1.165961 -1.188962  0.537421 -1.735304

In [15]:
# loc 이용하기
df.loc[dates[0]]

A   -0.110676
B    0.033004
C    1.018412
D    0.890824
Name: 2013-01-01 00:00:00, dtype: float64

In [16]:
# A, B 열의 모든 행 보기
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01 -0.110676  0.033004
2013-01-02 -0.280963  0.651658
2013-01-03 -1.950478  1.406947
2013-01-04 -1.165961 -1.188962
2013-01-05 -0.786793 -0.260679
2013-01-06 -0.529223 -1.382335

In [17]:
# 행과 열 범위 모두 지정해주기
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -0.280963  0.651658
2013-01-03 -1.950478  1.406947
2013-01-04 -1.165961 -1.188962

In [18]:
df.loc['20130102',['A','B']]

A   -0.280963
B    0.651658
Name: 2013-01-02 00:00:00, dtype: float64

In [19]:
df.loc[dates[0], 'A']

-0.1106763704131183

In [20]:
# iloc 사용하기
# 데이터프레임의 3행 보기
df.iloc[3]

A   -1.165961
B   -1.188962
C    0.537421
D   -1.735304
Name: 2013-01-04 00:00:00, dtype: float64

In [21]:
# 3, 4번째 행의 0부터 1까지 열
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -1.165961 -1.188962
2013-01-05 -0.786793 -0.260679

In [22]:
# 범위가 아니라 행이나 열을 지정해서 데이터 가져오기
df.iloc[[1,2,4], [0,2]]

                   A         C
2013-01-02 -0.280963 -0.248009
2013-01-03 -1.950478 -0.797436
2013-01-05 -0.786793 -0.578919

In [23]:
# 전체를 가져올 때
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -0.280963  0.651658 -0.248009 -0.040365
2013-01-03 -1.950478  1.406947 -0.797436 -0.187886

In [24]:
df.iloc[:,1:3]

                   B         C
2013-01-01  0.033004  1.018412
2013-01-02  0.651658 -0.248009
2013-01-03  1.406947 -0.797436
2013-01-04 -1.188962  0.537421
2013-01-05 -0.260679 -0.578919
2013-01-06 -1.382335  0.641045

In [25]:
# 특정 열 데이터 보기
# df['A']
df.A

2013-01-01   -0.110676
2013-01-02   -0.280963
2013-01-03   -1.950478
2013-01-04   -1.165961
2013-01-05   -0.786793
2013-01-06   -0.529223
Freq: D, Name: A, dtype: float64

In [26]:
# 특정 조건을 만족하는 데이터만 보기
df[df.A > 0]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [27]:
# 데이터 전체에 조건걸기
df[df>0]
# 만족하지 않은 곳은 결측치 NaN 처리가 된다.

             A         B         C         D
2013-01-01 NaN  0.033004  1.018412  0.890824
2013-01-02 NaN  0.651658       NaN       NaN
2013-01-03 NaN  1.406947       NaN       NaN
2013-01-04 NaN       NaN  0.537421       NaN
2013-01-05 NaN       NaN       NaN  0.808183
2013-01-06 NaN       NaN  0.641045  1.194339

In [28]:
# 복사할 때 카피를 사용하는 이유
df2 = df.copy()
# 내용도 복사된다.

In [29]:
# 카피를 사용하지 않으면?
df3 = df2

# 새로운 컬럼 추가하기
df3['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df3
df2
df
# 위치만 복사된다.

                   A         B         C         D
2013-01-01 -0.110676  0.033004  1.018412  0.890824
2013-01-02 -0.280963  0.651658 -0.248009 -0.040365
2013-01-03 -1.950478  1.406947 -0.797436 -0.187886
2013-01-04 -1.165961 -1.188962  0.537421 -1.735304
2013-01-05 -0.786793 -0.260679 -0.578919  0.808183
2013-01-06 -0.529223 -1.382335  0.641045  1.194339

In [30]:
# E 컬럼에 two, four가 있는지 조건을 걸고 싶을 때
df2['E'].isin(['two','four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [31]:
# 조건을 데이터프레임에 넣기
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -1.950478  1.406947 -0.797436 -0.187886   two
2013-01-05 -0.786793 -0.260679 -0.578919  0.808183  four

## 두 데이터프레임 병합하기

In [32]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'], 
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                   index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                   index=[4, 5, 6, 7])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                   index=[8, 9, 10, 11])

In [33]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [34]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [35]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

### concat

In [36]:
# concat으로 데이터프레임 합치기
# 열방향으로 단순하게 합친다
result = pd.concat([df1,df2,df3])
result
# 아무 옵션없이 단순히 열방향으로만 합친다.

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [37]:
# key 파라미터로 다중 인덱스 설정하기
result = pd.concat([df1,df2,df3], keys=['x','y','z'])
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [38]:
# 인덱스 확인하기
result.index

MultiIndex([('x',  0),
            ('x',  1),
            ('x',  2),
            ('x',  3),
            ('y',  4),
            ('y',  5),
            ('y',  6),
            ('y',  7),
            ('z',  8),
            ('z',  9),
            ('z', 10),
            ('z', 11)],
           )

In [39]:
result.index.get_level_values

<bound method MultiIndex.get_level_values of MultiIndex([('x',  0),
            ('x',  1),
            ('x',  2),
            ('x',  3),
            ('y',  4),
            ('y',  5),
            ('y',  6),
            ('y',  7),
            ('z',  8),
            ('z',  9),
            ('z', 10),
            ('z', 11)],
           )>

In [40]:
result.index.get_level_values(0)

Index(['x', 'x', 'x', 'x', 'y', 'y', 'y', 'y', 'z', 'z', 'z', 'z'], dtype='object')

In [41]:
result.index.get_level_values(1)

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], dtype='int64')

In [42]:
# axis 파라미터 설정하기
df4 = pd.DataFrame({'B': ['B2', 'B3', 'B6', 'B7'], 
                    'D': ['D2', 'D3', 'D6', 'D7'],
                    'F': ['F2', 'F3', 'F6', 'F7']},
                   index=[2, 3, 6, 7])

result = pd.concat([df1, df4], axis=1)

In [43]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [44]:
df4

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

In [45]:
result
# index를 기준으로 합친다.

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [46]:
# join 파라미터 설정하기
# inner join
result = pd.concat([df1, df4], axis=1, join='inner')
result

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [47]:
# 두 데이터프레임의 index를 무시하고 합치기
# ignore_index
result = pd.concat([df1, df4], ignore_index=True)
result

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

### merge

In [48]:
left = pd.DataFrame({'key': ['K0', 'K4', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                      'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']})

In [49]:
left

  key   A   B
0  K0  A0  B0
1  K4  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [50]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [51]:
# 공통된 key를 기준으로 합치기
pd.merge(left, right, on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

In [52]:
# 하나의 기준으로 합치기
# how
pd.merge(left, right, how='left', on='key')

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K4  A1  B1  NaN  NaN
2  K2  A2  B2   C2   D2
3  K3  A3  B3   C3   D3

In [53]:
pd.merge(left, right, how='right', on='key')
# 공통된 요소가 아닌 곳은 NaN 처리

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K2   A2   B2  C2  D2
2  K3   A3   B3  C3  D3
3  K1  NaN  NaN  C1  D1

In [54]:
# inner
pd.merge(left, right, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

In [55]:
result.drop([1,2,3])

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

## pivot_table

In [56]:
# 데이터 준비하기
df = pd.read_excel('../data/02. sales-funnel.xlsx')
df.head()

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
0,714466,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000,presented
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won

In [57]:
# 데이터프레임 정보 확인
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Account   17 non-null     int64
 1   Name      17 non-null     object
 2   Rep       17 non-null     object
 3   Manager   17 non-null     object
 4   Product   17 non-null     object
 5   Quantity  17 non-null     int64
 6   Price     17 non-null     int64
 7   Status    17 non-null     object
dtypes: int64(3), object(5)
memory usage: 1.2+ KB

In [59]:
# 피벗테이블 사용
# 중복 name은 하나로 합쳐지고 value는 평균을 갖게 됨.
# 기본적으로 숫자형 data 컬럼만 나온다.
pd.pivot_table(df, index=['Name'])

                              Account   Price  Quantity
Name
Barton LLC                     740150   35000  1.000000
Fritsch, Russel and Anderson   737550   35000  1.000000
Herman LLC                     141962   65000  2.000000
Jerde-Hilpert                  412290    5000  2.000000
Kassulke, Ondricka and Metz    307599    7000  3.000000
Keeling LLC                    688981  100000  5.000000
Kiehn-Spinka                   146832   65000  2.000000
Koepp Ltd                      729833   35000  2.000000
Kulas Inc                      218895   25000  1.500000
Purdy-Kunde                    163416   30000  1.000000
Stokes LLC                     239344    7500  1.000000
Trantow-Barrows                714466   15000  1.333333

In [60]:
# 인덱스를 여러 개 지정하기
pd.pivot_table(df, index=['Name', 'Rep', 'Manager'])

,,,Account,Price,Quantity
Name,Rep,Manager,,,
Barton LLC,John Smith,Debra Henley,740150,35000,1.000000
"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,737550,35000,1.000000
Herman LLC,Cedric Moss,Fred Anderson,141962,65000,2.000000
Jerde-Hilpert,John Smith,Debra Henley,412290,5000,2.000000
"Kassulke, Ondricka and Metz",Wendy Yule,Fred Anderson,307599,7000,3.000000
Keeling LLC,Wendy Yule,Fred Anderson,688981,100000,5.000000
Kiehn-Spinka,Daniel Hilton,Debra Henley,146832,65000,2.000000
Koepp Ltd,Wendy Yule,Fred Anderson,729833,35000,2.000000
Kulas Inc,Daniel Hilton,Debra Henley,218895,25000,1.500000
Purdy-Kunde,Cedric Moss,Fred Anderson,163416,30000,1.000000
Stokes LLC,Cedric Moss,Fred Anderson,239344,7500,1.000000
Trantow-Barrows,Craig Booker,Debra Henley,714466,15000,1.333333

In [61]:
# 특정 value만 지정해서 나타나게 하기
pd.pivot_table(df, index=['Manager', 'Rep'], values=['Price'])

                                    Price
Manager       Rep
Debra Henley  Craig Booker   20000.000000
              Daniel Hilton  38333.333333
              John Smith     20000.000000
Fred Anderson Cedric Moss    27500.000000
              Wendy Yule     44250.000000

In [62]:
# value의 평균이 아니라 합계로 옵션 변경하기
pd.pivot_table(df, index=['Manager', 'Rep'], values=['Price'], aggfunc=np.sum)

                              Price
Manager       Rep
Debra Henley  Craig Booker    80000
              Daniel Hilton  115000
              John Smith      40000
Fred Anderson Cedric Moss    110000
              Wendy Yule     177000

In [64]:
pd.pivot_table(df, index=['Manager', 'Rep', 'Product'], values=['Price', 'Quantity'], 
               aggfunc=[np.sum, np.mean],
               fill_value=0, # 빈 값이 나오면 NaN이 아니라 0으로 채우기
               margins=True) # 총계(All)을 내준다

                                            sum                   mean  \
                                          Price Quantity         Price
Manager       Rep           Product
Debra Henley  Craig Booker  CPU           65000        2  32500.000000
                            Maintenance    5000        2   5000.000000
                            Software      10000        1  10000.000000
              Daniel Hilton CPU          105000        4  52500.000000
                            Software      10000        1  10000.000000
              John Smith    CPU           35000        1  35000.000000
                            Maintenance    5000        2   5000.000000
Fred Anderson Cedric Moss   CPU           95000        3  47500.000000
                            Maintenance    5000        1   5000.000000
                            Software      10000        1  10000.000000
              Wendy Yule    CPU          165000        7  82500.000000
                            Maintenance    7000        3   7000.000000
                            Monitor        5000        2   5000.000000
All                                      522000       30  30705.882353


                                         Quantity
Manager       Rep           Product
Debra Henley  Craig Booker  CPU          1.000000
                            Maintenance  2.000000
                            Software     1.000000
              Daniel Hilton CPU          2.000000
                            Software     1.000000
              John Smith    CPU          1.000000
                            Maintenance  2.000000
Fred Anderson Cedric Moss   CPU          1.500000
                            Maintenance  1.000000
                            Software     1.000000
              Wendy Yule    CPU          3.500000
                            Maintenance  3.000000
                            Monitor      2.000000
All                                      1.764706